app/controllers/home_controller.rb

  def create
   	@user =  User.new(name:params[:user][:name], email:params[:user][:email], password: 'password', password_confirmation: 'password')
  	address = params[:user][:user_address]
  	@user.user_addresses.new(address_line1: address[:address_line1], address_line2: address[:address_line2], phone:address[:phone] , city:address[:city], state:address[:state], postal_code:address[:postal_code] )
  	if @user.save
---
INSERT INTO `user_addresses` (`address_line1`, `address_line2`, `phone`, `city`, `state`, `postal_code`, `user_id`, `created_at`, `updated_at`) VALUES ('A-36', 'Sector 71', '09540691880', 'Noida', 'Uttar Pradesh', '201301', 2, '2017-12-10 13:33:45', '2017-12-10 13:33:45')
INSERT INTO `users` (`name`, `email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('Priyanka Pandey', 'pandeypriyanka02@gmail.com', '$2a$10$LOkV1DDxNm7Ajw1/HCHmbO5o8ClNGfU/GL.nG4AGru6nzmIzMWx/2', '2017-12-10 13:32:02', '2017-12-10 13:32:02')