app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'p'  ORDER BY `users`.`id` ASC LIMIT 1
---
  def validate
    @user = User.where(email:params[:email]).first